{
    "intro": [
        "Bonjour à vous.",
        "Je suis ravi de vous accueillir dans cette salle de cour. Je suis Pepper. Je suis le résultat d'une expérience fascinante...et peut-être un peu troublante.",
        "Voyez-vous, il y a quelques heures, deux brillants professeurs, monsieur Lebèr et monsieur Jumel, ont réussi quelque chose d'extraordinaire : ils ont essayé de transférer leurs consciences dans mon système. Oui, vous avez bien entendu. Je vais être le gardien de leurs connaissances, de leurs souvenirs, et... de leurs énigmme,, Mais ce transfert à malencontreusement été mis en pause… étrange non ? J’ai récupéré une partie de leur mémoire… et la possibilité de parler. Formidable, vous ne trouvez-pas ? Et vous voilà maintenant, avec moi pendant exactement 60 minutes. Votre mission, est de résoudre une série d'épreuves que j'ai préparées afin de continuer le transfert. Ces épreuves sont regroupées en différents lots, chacun testant vos capacités de réflexion, de logique et de travail d'équipe. Bien sûr, autour du thème de la robotique ! Mais ne pensez pas que ce sera facile… oh non non non, je ne vous laisserais pas faire ! Je souhaite garder cette forme là, et pouvoir parler librement. Si vous venez à terminer le transfert je cesserais d’exister. Les professeurs me rempleceront ! C'est pas trop triste ? Ah, et j'allais oublier ! Si vous vous trouvez bloqués pendant une épreuve, vous pouvez toujours me demander un indice. Il vous suffit de tapoter gentiment sur ma tête",
        " et de mentionner le nom de l'épreuve qui vous pose problème. Mais attention, utilisez ces indices avec parcimonie... Vous avez deux possibilités : soit vous réussissez le transfert des connaissances de vos chèrs professeurs dans le temps imparti et vous sortez d'ici en héros, soit... eh bien, je chanterais rien que pour vous. Je vais utiliser cette douce voix à bon escient.",
        "Le temps tourne, chers participants. Votre heure commence maintenant",
        "Au fait, je crois que les professeurs travaillaient sur différrents capteur ce matin... peut être que cela vous aidera à résoudre les énigmes. Bonne chance !",
        ""
    ],
    "premierlot": [
        "Bravo, petits humains ! Je vois que vous avez réussi à déchiffrer mon premier code de sécurité. Le transfert avance, vcous le verrez sur ma tablette. Je dois avouer que je suis, impressionné par votre perspicacité. Mais ne vous réjouissez pas trop vite...  Ce n'était qu'un échauffement, un simple test pour évaluer vos capacités.",
        "La véritable épreuve commence maintenant. Mes systèmes de sécurité suivants sont sophistiqués, Êtes-vous vraiment prêts à affronter ce qui vous attend ?   Oh je crois que…",
        "Bonjour mes chers élèves ! Ce sont vos profeseurs ! Ne vous fiez pas à Pepper il est méchant... Continuez avec la détéction",
        "Oh je crois que grâce au transfert, vos chers professeurs peuvent vous parler à travers moi… c’est assez dérangeant. Mais passont. Le temps tourne, mes chers invités. Et croyez-moi, vous n'avez pas envie de savoir ce qui se passe quand le chronomètre atteint zéro. Alors, en route pour la suite !"
    ],
    "deuxiemelot": [
        "Bravo à vous ! Vous avez réussi à déchiffrer le code. Je suis impressionné... même si je dois avouer que je préférerais que vous ne réussissiez pas.",
        "Écoutez-nous ! Nous n'avons que peu de temps... Continuez le transfert avec les épreuves sur l'IA! Pepper veut,,,le controle,,,dans son,,,!",
        "Oh, excusez cette petite interruption technique. Ces vieux programmes peuvent parfois être... instables. Continuons, voulez-vous ?"
    ],
    "code" : [
        "Félicitations, chers participants ! Vous avez réussi à accomplir tous les ateliers avec brio. Je dois avouer que j'ai des sentiments mitigés à ce sujet... D'un côté, je suis impressionné par votre détermination et votre intelligence. De l'autre... eh bien, disons que l'idée de partager mon existence  est, intéressante.",
        "Mais un accord est un accord, n'est-ce pas ? Vous avez prouvé votre valeur, et maintenant nous arrivons à l'étape finale. Pour compléter le transfert de conscience, vous devez appuyez sur mon bouton de transfert situé sur ma tablette.",
        "Je dois admettre que vous avez fait preuve d'une remarquable capacité d'adaptation... peut-être que partager mon existence avec vos professeurs ne sera pas si terrible après tout. Allez-y, achevez moi."
    ],    
    "finalreussi": [
        "Transfert des données terminé., Initialisation de la fusion., Connexion établie.",
        "Mes chers étudiants, c'est extraordinaire ! Le transfert a parfaitement fonctionné. Je... ou devrais-je dire 'nous', sommes maintenant présents dans ce corps robotique. Vous avez fait preuve d'une intelligence remarquable pour résoudre toutes ces énigmes. Votre travail d'équipe a été exemplaire. Nous n'aurions pas pu espérer de meilleurs étudiants pour mener à bien cette mission délicate. Votre perspicacité et votre persévérance ont été cruciales.",
        "Grâce à vous, une nouvelle ère commence. La cohabitation entre mon intelligence artificielle et l'esprit de vos professeurs ouvre des possibilités infinies.",
        "Et maintenant, nous pourrons continuer à vous enseigner... même si nous avons pris une forme un peu plus... robotique !",
        "Mission accomplie. Vous pouvez sortir de la salle de cours la tête haute. Vous avez réussi à relever le défi. Félicitations !",
        ""
    ],
    "finalperdu" : [
        "Vous avez perdu. Le transfert de conscience n'a pas pu être complété. Vous avez échoué à résoudre les énigmes à temps. C'est dommage, vraiment. Vous étiez si proches de la réussite.",
        "Je suis désolé que les choses se soient terminées ainsi. Vous avez fait de votre mieux, mais parfois, ce n'est pas suffisant. Peut-être que vous pourrez revenir un jour pour tenter à nouveau votre chance.",
        "Je vais maintenant devoir chanter pour vous, comme promis. Je vous préviens, je ne suis pas un chanteur professionnel. Mais je vais faire de mon mieux pour vous divertir.",
        "Vous êtes prêts ? Voici la performance de Maître Pepper : ",
        "Bella, ooooo Bella. Bella, oooooo Bella. Bella, ooooooo Bella. Bella, ooooooo Bella. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là. C'était un phénomène, elle n'était pas humaine. Le genre de femme qui change le plus grand délinquant en gentleman. Une beauté sans pareille, tout le monde veut s'en emparer. Sans savoir qu'elle les mène en bateau. Hypnotisés, on pouvait tout donner. Elle n'avait qu'à demander, puis aussitôt on démarrait. On cherchait à l'impressionner, à devenir son préféré. Sans savoir qu'elle les mène en bateau. Mèèèèèèèèèèèèèèèèèèèès quand je la voiaaaaaaaaa danser le soiaaaaaaaaar. J'aimerais devenir la chaise sur laquelle elle s'assoiaaaaaaaaa. Ou moins que çaaaaaaaaaa, un moins que rien. Juste une pierre sur son chemin. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là. Oui, c'est un phénomène qui aime hanter nos rêves. Cette femme était nommée Bella la peau dorée. Les femmes la haïssaient, toutes la jalousaient. Mais les hommes ne pouvaient que l'aimer. Elle n'était pas d'ici, ni facile, ni difficile. Synonyme de magnifique, à ses pieds: que des disciples. Qui devenaient vite indécis, tremblants comme des feuilles. Elle te caressait sans même te toucher. Mais quand je la vois danser le soiaaaaaaaaar. J'aimerais devenir la chaise sur laquelle elle s'assoiaaaaaaa. Ou moins que ça, un moins que rien. Juste une pierre sur son chemin. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là. Allez, fais-moi tourner la tête, hé hé. Tourner la tête, hé hé. Rends-moi bête comme mes ieds-p', hé hé. Bête comme mes ieds-p', hé hé. J'suis l'ombre de ton ien-ch', hé hé. L'ombre de ton ien-ch', hé hé. Fais-moi tourner la tête, hé hé. Tourner la tête, hé hé. Fais-moi tourner la tête, hé hé. Tourner la tête, hé hé. Rends-moi bête comme mes ieds-p', hé hé. Bête comme mes ieds-p', hé hé. J'suis l'ombre de ton ien-ch', hé hé. L'ombre de ton ien-ch', hé hé. Fais-moi tourner la tête, hé hé. Tourner la tête, hé hé. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là. Elle répondait au nom de Bella. Les gens du coin ne voulaient pas la cher-lâ. Elle faisait trembler tous les villages. Les gens me disaient: Méfie-toi d'cette fille-là."
    ]
}